app/Controllers/Auth.php

SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `course_id` = '4'
---
public function dashboard()
{
    $session = \Config\Services::session();

    // Redirect kung hindi naka-login
    if (!$session->get('isLoggedIn')) {
        log_message('debug', 'User not logged in, redirecting to login');
        return redirect()->to(base_url('login'));
    }

    // 🔹 Get user info from session
    $role   = $session->get('role');
    $userID = $session->get('userID');

    // Debug: log session data
    log_message('debug', 'Session data: ' . json_encode([
        'isLoggedIn' => $session->get('isLoggedIn'),
        'role' => $role,
        'userID' => $userID,
        'name' => $session->get('name'),
        'email' => $session->get('email')
    ]));

    // Load models
    $userModel       = new \App\Models\UserModel();
    $courseModel     = new \App\Models\CourseModel();
    $enrollmentModel = new \App\Models\EnrollmentModel();
    $materialModel   = new \App\Models\MaterialModel();

    // Base data - initialize all variables to prevent undefined errors
    $data = [
        'user' => [
            'id'    => $userID,
            'name'  => $session->get('name'),
            'email' => $session->get('email'),
            'role'  => $role,
            'created_at' => $session->get('created_at'),
            'last_login' => $session->get('last_login')
        ],
        'flash' => [
            'success' => $session->getFlashdata('success'),
            'error'   => $session->getFlashdata('error')
        ],
        'totalUsers'   => 0,
        'totalCourses' => 0,
        'myCourses'    => [],
        'enrolled'     => [],
        'available'    => [],
        'materials'    => [],
        'enrollments'  => [],
        'recentUploads' => []
    ];