app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('Bastos ka', 'admin@example.com', '$2y$10$xy7qo2s9gbSG3gyo.NjMEuXdC7K2bdbGH7bFfCW0oe.LOoqqvYH7y', 'student', '2025-09-09 02:28:57', '2025-09-09 02:28:57')
---
    public function register()
    {
        $session    = \Config\Services::session();
        $validation = \Config\Services::validation();
        $db         = \Config\Database::connect();

        if ($session->get('isLoggedIn')) {
            return redirect()->to(base_url('dashboard'));
        }

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'name'             => 'required|min_length[3]|max_length[100]',
                'email'            => 'required|valid_email|is_unique[users.email]',
                'password'         => 'required|min_length[6]',
                'password_confirm' => 'required|matches[password]'
            ];

            if ($this->validate($rules)) {
                $db->table('users')->insert([
                    'name'       => $this->request->getPost('name'),
                    'email'      => $this->request->getPost('email'),
                    'password'   => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
                    'role'       => 'user', // default role
                    'created_at' => date('Y-m-d H:i:s'),
                    'updated_at' => date('Y-m-d H:i:s')
                ]);

SELECT *
FROM `users`
WHERE `email` = 'marcobatiller07@gmail.com'
---

        // 🔹 Identify if email or name is used for login
        if (filter_var($login, FILTER_VALIDATE_EMAIL)) {
            $user = $db->table('users')->where('email', $login)->get()->getRowArray();

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `courses`
---
public function dashboard()
{
    $session = \Config\Services::session();

    // ✅ Redirect kung hindi naka-login
    if (!$session->get('isLoggedIn')) {
        return redirect()->to(base_url('login'));
    }

    // 🔹 Get user info from session
    $role   = $session->get('role');
    $userID = $session->get('userID');

    // 🔹 Load models
    $userModel       = new \App\Models\UserModel();
    $courseModel     = new \App\Models\CourseModel();
    $enrollmentModel = new \App\Models\EnrollmentModel();

    // 🔹 Common user data (accessible sa view)
    $data = [
        'user' => [
            'id'    => $userID,
            'name'  => $session->get('name'),
            'email' => $session->get('email'),
            'role'  => $role
        ],
        'flash' => $session->getFlashdata('success'),
        // optional defaults para maiwasan undefined variable notice
        'totalUsers'   => null,
        'totalCourses' => null,
        'myCourses'    => [],
        'enrolled'     => [],
        'available'    => []
    ];

SELECT *
FROM `courses`
---

        // Get available courses (not enrolled)
        if (!empty($enrolledIDs)) {
            $available = $courseModel->whereNotIn('id', $enrolledIDs)->findAll();