app/Controllers/Materials.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'
SELECT *
FROM `enrollments`
WHERE `course_id` = '2'
---
                $courseModel = new \App\Models\CourseModel();

                // Get course details
                $course = $courseModel->find($course_id);
                if ($course) {
                    // Get all enrolled students
                    $enrolledStudents = $enrollmentModel->where('course_id', $course_id)->findAll();