app/Controllers/User.php

    public function index()
    {
        $session = session();

        // Check if user is logged in and is admin
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to(base_url('dashboard'));
        }

        $users = $this->userModel->findAll();
---
SELECT *
FROM `users`