app/Models/CourseModel.php

SELECT *
FROM `courses`
WHERE `id` NOT IN ('4','5')
---
    public function getAvailableCourses($enrolledIds = [])
    {
        if (empty($enrolledIds)) {
            return $this->findAll();
        }
        return $this->whereNotIn('id', $enrolledIds)->findAll();