app/Models/EnrollmentModel.php

    public function getUserEnrollments($userID)
    {
        return $this->select('courses.id, courses.title, courses.description')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.user_id', $userID)
                    ->findAll();
---
SELECT `courses`.`id`, `courses`.`title`, `courses`.`description`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '3'