app/Models/EnrollmentModel.php

    public function getUserEnrollments($userID)
    {
        return $this->select('enrollments.id, courses.id as course_id, courses.title, courses.description, courses.school_year, courses.semester, enrollments.enrollment_date')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.user_id', $userID)
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->findAll();
---
SELECT `enrollments`.`id`, `courses`.`id` as `course_id`, `courses`.`title`, `courses`.`description`, `enrollments`.`enrollment_date`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '3'
ORDER BY `enrollments`.`enrollment_date` DESC