app/Models/MaterialModel.php

    public function getMaterialsByCourse($course_id)
    {
        return $this->where('course_id', $course_id)->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = '5'

    public function insertMaterial(array $data)
    {
        return $this->insert($data);
---
INSERT INTO `materials` (`course_id`, `file_name`, `file_path`, `created_at`) VALUES ('2', 'Letter 2.docx', 'uploads/materials/1765254115_Letter_2.docx', '2025-12-09 12:21:55')