app/Models/NotificationModel.php

    public function getUnreadCount(int $userId): int
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 2
AND `is_read` = 0

    public function getLatest(int $userId, int $limit = 10): array
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->find();
---
SELECT *
FROM `notifications`
WHERE `user_id` = 2
ORDER BY `created_at` DESC
 LIMIT 10

    public function add(int $userId, string $message)
    {
        return $this->insert([
            'user_id'   => $userId,
            'message'   => $message,
            'is_read'   => 0,
            'created_at'=> date('Y-m-d H:i:s')
        ]);
---
INSERT INTO `notifications` (`user_id`, `message`, `is_read`, `created_at`) VALUES (6, 'New material uploaded: Letter 2.docx in ANA ANA LANGS', 0, '2025-12-09 12:21:55')

    public function markAsRead(int $id): bool
    {
        return (bool) $this->update($id, ['is_read' => 1]);
---
UPDATE `notifications` SET `is_read` = 1
WHERE `notifications`.`id` IN (24)